In [1]:
import pandas as pd

In [2]:
student1 =  pd.Series({'국어':100, '영어':80, '수학':90})
student1

국어    100
영어     80
수학     90
dtype: int64

In [3]:
percentage = student1/200
print(type(percentage))
percentage

<class 'pandas.core.series.Series'>

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [4]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})

print(student1,end='\n\n')
print(student2)

국어    100
영어     80
수학     90
dtype: int64

수학    80
국어    90
영어    80
dtype: int64

In [5]:
add = student1+student2
sub = student1-student2
mul = student1*student2
div = student1/student2

result = pd.DataFrame([add,sub,mul,div], index=['덧셈','뺄셈','곱셈','나눗셈'])
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

- Series 연산을 하는 중 Nan값이 포함되거나 처리할 수 없는 연산값일 때는 모두 Nan 처리되어 저장된다
- 이를 방지하기위해 연산 메소드를 사용하며 fill_value 옵션을 적용할 수 있다
    - Ex) Series1.add(Series2,fill_value=0)

## dataframe 연산

In [6]:
import pandas as pd
import seaborn as sns

In [7]:
# titanic 데이터셋에서 age, fare 2개 열을 선택해서 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:,['age','fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
add = df + 10
add.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500